misteraddons/Reflex-Adapt/hardware/misteraddons/avr/boards.txt
reflex.name=Reflex Adapt
reflex.vid.0=0x2341
reflex.pid.0=0x0036
reflex.vid.1=0x2341
reflex.pid.1=0x8036
reflex.vid.2=0x2A03
reflex.pid.2=0x0036
reflex.vid.3=0x2A03
reflex.pid.3=0x8036
reflex.upload_port.0.vid=0x2341
reflex.upload_port.0.pid=0x0036
reflex.upload_port.1.vid=0x2341
reflex.upload_port.1.pid=0x8036
reflex.upload_port.2.vid=0x2A03
reflex.upload_port.2.pid=0x0036
reflex.upload_port.3.vid=0x2A03
reflex.upload_port.3.pid=0x8036
reflex.upload_port.4.board=leonardo

reflex.upload.tool=arduino:avrdude
reflex.upload.tool.default=arduino:avrdude
reflex.upload.tool.network=arduino_ota
reflex.upload.protocol=avr109
reflex.upload.maximum_size=28672
reflex.upload.maximum_data_size=2560
reflex.upload.speed=57600
reflex.upload.disable_flushing=true
reflex.upload.use_1200bps_touch=true
reflex.upload.wait_for_upload_port=true

reflex.bootloader.tool=arduino:avrdude
reflex.bootloader.tool.default=arduino:avrdude
reflex.bootloader.low_fuses=0xff
reflex.bootloader.high_fuses=0xd8
reflex.bootloader.extended_fuses=0xcb
#reflex.bootloader.file=caterina/Caterina-Leonardo.hex
reflex.bootloader.unlock_bits=0x3F
reflex.bootloader.lock_bits=0x2F

reflex.build.mcu=atmega32u4
reflex.build.f_cpu=16000000L
reflex.build.vid=0x2341
reflex.build.pid=0x8036
reflex.build.usb_product="Arduino Leonardo"
reflex.build.board=AVR_LEONARDO
reflex.build.core=arduino:arduino
reflex.build.variant=arduino:leonardo
reflex.build.extra_flags={build.usb_flags}

